; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v8)
             (pred_2 ?v2 ?v7)
             (pred_8 ?v4 ?v7)
             (pred_7 ?v10 ?v4 )
	     (pred_10 ?v4)
             (pred_3 ?v6)
             (pred_12 ?v2)
             (pred_11 ?v7)
             (pred_9 ?v4)
             (pred_4 ?v2)
             (pred_6 ?v4)
             (pred_1 ))



(:action op_4
:parameters (?v12 ?v1 ?v5 ?v9)
:precondition (and (pred_3 ?v12) (pred_3 ?v1) (pred_12 ?v5) (pred_11 ?v9)
          (pred_5 ?v12 ?v1) (pred_2 ?v5 ?v9)
                   (pred_8 ?v1 ?v9) (pred_10 ?v12) 
                   (pred_9 ?v1) (pred_4 ?v5))
:effect (and  (pred_6 ?v1) (not (pred_9 ?v1))))


(:action op_1
:parameters (?v12 ?v11)
:precondition (and (pred_3 ?v12) (pred_3 ?v11)
               (pred_10 ?v12) (pred_5 ?v12 ?v11) (pred_6 ?v11))
:effect (and (pred_10 ?v11) (not (pred_10 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_3 ?v12) (pred_12 ?v5) 
                  (pred_10 ?v12) (pred_7 ?v5 ?v12) (pred_1 ))
:effect (and (pred_4 ?v5)
   (not (pred_7 ?v5 ?v12)) (not (pred_1 ))))


(:action op_3
:parameters (?v12 ?v13 ?v3)
:precondition (and (pred_3 ?v12) (pred_12 ?v13) (pred_12 ?v3)
                  (pred_10 ?v12) (pred_4 ?v3) (pred_7 ?v13 ?v12))
:effect (and (pred_4 ?v13) (pred_7 ?v3 ?v12)
        (not (pred_4 ?v3)) (not (pred_7 ?v13 ?v12))))

(:action op_2
:parameters (?v12 ?v5)
:precondition (and (pred_3 ?v12) (pred_12 ?v5) 
                  (pred_10 ?v12) (pred_4 ?v5))
:effect (and (pred_1 ) (pred_7 ?v5 ?v12) (not (pred_4 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_18 obj_09 obj_20 obj_22 obj_03 obj_04 obj_16 obj_15 obj_11 obj_13 obj_10 obj_12 obj_14 obj_02 obj_06
    obj_07 obj_08 obj_21
    obj_19 obj_17 obj_05
    )

    (:init
       (pred_1)

       (pred_3 obj_01)
       (pred_3 obj_18)
       (pred_3 obj_09)
       (pred_3 obj_20)
       (pred_3 obj_22)
       (pred_3 obj_03)
       (pred_3 obj_04)
       (pred_3 obj_16)
       (pred_3 obj_15)
       (pred_3 obj_11)
       (pred_3 obj_13)
       (pred_3 obj_10)
       (pred_3 obj_12)
       (pred_3 obj_14)
       (pred_3 obj_02)
       (pred_3 obj_06)
       (pred_11 obj_07)
       (pred_11 obj_08)
       (pred_11 obj_21)
       (pred_12 obj_19)
       (pred_12 obj_17)
       (pred_12 obj_05)

       (pred_5 obj_01 obj_22)
       (pred_5 obj_01 obj_18)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_18 obj_09)
       (pred_5 obj_18 obj_01)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_09 obj_18)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_22 obj_15)
       (pred_5 obj_22 obj_03)
       (pred_5 obj_22 obj_01)
       (pred_5 obj_03 obj_11)
       (pred_5 obj_03 obj_04)
       (pred_5 obj_03 obj_18)
       (pred_5 obj_03 obj_22)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_16 obj_04)
       (pred_5 obj_15 obj_12)
       (pred_5 obj_15 obj_11)
       (pred_5 obj_15 obj_22)
       (pred_5 obj_11 obj_14)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_11 obj_03)
       (pred_5 obj_11 obj_15)
       (pred_5 obj_13 obj_02)
       (pred_5 obj_13 obj_10)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_10 obj_13)
       (pred_5 obj_12 obj_14)
       (pred_5 obj_12 obj_15)
       (pred_5 obj_14 obj_02)
       (pred_5 obj_14 obj_11)
       (pred_5 obj_14 obj_12)
       (pred_5 obj_02 obj_06)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_14)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_06 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_10)
       (pred_9 obj_03)
       (pred_8  obj_04 obj_07)
       (pred_8  obj_10 obj_08)
       (pred_8  obj_03 obj_21)
       (pred_6 obj_01)
       (pred_6 obj_18)
       (pred_6 obj_09)
       (pred_6 obj_20)
       (pred_6 obj_22)
       (pred_6 obj_16)
       (pred_6 obj_15)
       (pred_6 obj_11)
       (pred_6 obj_13)
       (pred_6 obj_12)
       (pred_6 obj_14)
       (pred_6 obj_02)
       (pred_6 obj_06)

       (pred_2  obj_19 obj_07)
       (pred_2  obj_17 obj_08)
       (pred_2  obj_05 obj_21)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_17 obj_04)
       (pred_7 obj_05 obj_12)
       (pred_10 obj_02)
    )

    (:goal (and
       (pred_7 obj_05 obj_15)
    ))
(:constraints
  (always (not (pred_10 obj_14)))
)
)

; plan
1. (op_1 obj_02 obj_13)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_13)
   goals met: 0 of 1
2. (op_1 obj_13 obj_11)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_11)
   goals met: 0 of 1
3. (op_1 obj_11 obj_15)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_15)
   goals met: 0 of 1
4. (op_1 obj_15 obj_12)
   deleted: (pred_10 obj_15)
   added: (pred_10 obj_12)
   goals met: 0 of 1
5. (op_5 obj_12 obj_05)
   deleted: (pred_7 obj_05 obj_12) (pred_1)
   added: (pred_4 obj_05)
   goals met: 0 of 1
6. (op_1 obj_12 obj_15)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_15)
   goals met: 0 of 1
7. (op_2 obj_15 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_1) (pred_7 obj_05 obj_15)
   goals met: 1 of 1
